АлогистикТест2/src/Catalogs/алк_ШаблоныОТК/алк_ШаблоныОТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ШаблоныОТК</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДобалениеСтрокВТаблицеАкта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоПакетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРавноСуммеЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Колонки</name>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСсылочногоЗначения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСписокЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Строки</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличество</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсключитьИзПроверкиКоличества</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСоответствия</name>
      <type>
        <types>EnumRef.алк_ВидыСоответствияСортуОТК</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Число</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязателенКЗаполнению</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Булево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокДопустимыхЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>355</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидимостьСтатичныхРеквизитов</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Команда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКоманды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/алк_ШаблоныОТК/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СтрочкиСерийныйНомер.Видимость = Объект.ПоПакетам; 
	ПоПакетамВидимость();	
КонецПроцедуры  
  
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ПроверятьКоличество И Объект.Строки.НайтиСтроки(Новый Структура("ОбщееКоличество", Истина)).Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строчки с общим количеством");
		Отказ = Истина;	
	КонецЕсли;
	
	Если Объект.ПроверятьКоличество Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Колонка", "Значение");
		ПараметрыОтбора.Вставить("ТипСсылочногоЗначения", "");		
		КолонкаЗначение = Объект.Колонки.НайтиСтроки(ПараметрыОтбора);
		
		Если КолонкаЗначение.Количество() = 0 Тогда
			Сообщить("Для проверки общего количества долна быть колонка ""Значение"" с типом Число");
			Отказ = Истина;		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ДобалениеСтрокВТаблицеАкта И Объект.Строки.Количество() <> 1 Тогда 
		Сообщить("Если разрешено добавлять строки в таблицу акта, то в таблице строк должна быть только одна запись(она же и будет дублироваться)");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоПакетамПриИзменении(Элемент)
	ПоПакетамВидимость();
КонецПроцедуры  

 &НаКлиенте
 Процедура ПоПакетамВидимость()    
	Элементы.Сорт.Видимость = НЕ Объект.ПоПакетам;
	Элементы.СтрочкиВидСоответствияСорту.Видимость = НЕ Объект.ПоПакетам;
	Элементы.СтрочкиСерийныйНомер.Видимость = Объект.ПоПакетам; 
    Элементы.ПроверкаКоличества.Видимость = НЕ Объект.ПоПакетам;
КонецПроцедуры

//&НаКлиенте
//Процедура ПоПакетамВидимость()
//	Элементы.грРеквизиты.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.Колонки.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.Сорт.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.СтрочкиВидСоответствияСорту.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.ПроверкаКоличества.Видимость = НЕ Объект.ПоПакетам;
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ПоПакетам Тогда
		
	КонецЕсли;
	
		Для Каждого ТипЗначения Из Метаданные.РегистрыНакопления.алк_ДанныеАктаОТК.Реквизиты.СсылочноеЗначение.Тип.Типы() Цикл
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
			Элементы.КолонкиТипСсылочногоЗначения.СписокВыбора.Добавить("СправочникСсылка." + ОбъектМетаданных.Имя, ОбъектМетаданных.Представление());	
		КонецЦикла;
	

КонецПроцедуры
